saas201-gowtham.k/LEVEL-08/college_portal/app/controllers/departments_controller.rb

	def create
		unless current_user.admin?
    	  flash[:danger] = "You are not allowed to access this page."
    	  redirect_to root_path
  		end
		@department=Department.new(department_params)
		if @department.save
---
INSERT INTO "departments" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "CSE"], ["created_at", "2019-10-01 13:28:53.003071"], ["updated_at", "2019-10-01 13:28:53.003071"]]