saas201-gowtham.k/LEVEL-08/college_portal/app/controllers/sections_controller.rb

SELECT "sections".* FROM "sections" WHERE "sections"."department_id" = ?  [["department_id", 8]]
SELECT "sections".* FROM "sections"
---
	def index
		if params[:department_id]
      		@sections = Section.where(department_id: params[:department_id]).all
    	else
      		@sections = Section.all

SELECT "departments".* FROM "departments"
---
	def new
      unless current_user.admin?
        flash[:danger] = "You are not allowed to access this page."
        redirect_to root_path
      end
    	@section = Section.new
    	@department_collection = Department.all.collect { |p| [p.name, p.id] }

INSERT INTO "sections" ("name", "created_at", "updated_at", "department_id") VALUES (?, ?, ?, ?)  [["name", "B"], ["created_at", "2019-10-01 17:59:45.828037"], ["updated_at", "2019-10-01 17:59:45.828037"], ["department_id", 7]]
---
  	def create
      unless current_user.admin?
        flash[:danger] = "You are not allowed to access this page."
        redirect_to root_path
      end
    	@section = Section.new(section_params)
    	if @section.save