saas201-gowtham.k/LEVEL-08/college_portal/app/controllers/students_controller.rb

	def index
		if params[:department_id]
      		@students = Student.where(section_id: params[:section_id]).all
    	else
      		@students = Student.all
---
SELECT "students".* FROM "students"

	  def new
      unless current_user.admin?
        flash[:danger] = "You are not allowed to access this page."
        redirect_to root_path
      end
    	@student = Student.new
      @section_collection = Section.all.collect { |p| [p.name, p.id] }
      @department_collection = Department.all.collect { |p| [p.name, p.id] }
---
SELECT "sections".* FROM "sections"
SELECT "departments".* FROM "departments"

  	def create
      unless current_user.admin?
        flash[:danger] = "You are not allowed to access this page."
        redirect_to root_path
      end
    	@student = Student.new(student_params)
    	if @student.save
---
INSERT INTO "students" ("name", "created_at", "updated_at", "department_id", "section_id") VALUES (?, ?, ?, ?, ?)  [["name", "gk"], ["created_at", "2019-10-01 18:08:49.714203"], ["updated_at", "2019-10-01 18:08:49.714203"], ["department_id", 6], ["section_id", 3]]