saas201-gowtham.k/LEVEL-07/college_portal/app/controllers/sections_controller.rb

	def index
		if params[:department_id]
      		@sections = Section.where(department_id: params[:department_id]).all
    	else
      		@sections = Section.all
---
SELECT "sections".* FROM "sections" WHERE "sections"."department_id" = ?  [["department_id", 8]]
SELECT "sections".* FROM "sections"

	def new
    	@section = Section.new
    	@department_collection = Department.all.collect { |p| [p.name, p.id] }
---
SELECT "departments".* FROM "departments"

  	def create
    	@section = Section.new(section_params)
    	if @section.save
---
INSERT INTO "sections" ("name", "created_at", "updated_at", "department_id") VALUES (?, ?, ?, ?)  [["name", "B"], ["created_at", "2019-10-01 17:59:45.828037"], ["updated_at", "2019-10-01 17:59:45.828037"], ["department_id", 7]]