saas201-gowtham.k/LEVEL-06/college_portal/app/controllers/departments_controller.rb

INSERT INTO "departments" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "CSE"], ["created_at", "2019-10-01 13:28:53.003071"], ["updated_at", "2019-10-01 13:28:53.003071"]]
---
	def create
		@department=Department.new(department_params)
		if @department.save