saas201-gowtham.k/LEVEL-06/college_portal/app/controllers/students_controller.rb

SELECT "students".* FROM "students"
---
	def index
		if params[:department_id]
      		@students = Student.where(section_id: params[:section_id]).all
    	else
      		@students = Student.all

SELECT "sections".* FROM "sections"
SELECT "departments".* FROM "departments"
---
	def new
    	@student = Student.new
    	@section_collection = Section.all.collect { |p| [p.name, p.id] }
      @department_collection = Department.all.collect { |p| [p.name, p.id] }

INSERT INTO "students" ("name", "created_at", "updated_at", "department_id", "section_id") VALUES (?, ?, ?, ?, ?)  [["name", "gk"], ["created_at", "2019-10-01 18:08:49.714203"], ["updated_at", "2019-10-01 18:08:49.714203"], ["department_id", 6], ["section_id", 3]]
---
  	def create
    	@student = Student.new(student_params)
    	if @student.save